In [1]:
import sklearn
import numpy as np
import pandas as pd
print("scikit-learn version:", sklearn.__version__)

scikit-learn version: 1.7.1

In [3]:
data = {
    "Name": ["Alice", "Bob", "Charlie" , "David" , "Eve"],
    "Age": [25, None, 35, 40, None],
    "City": ["New York", "Los Angeles", "Chicago" , "Houston", "Phoenix"],
    "Salary": [70000, 80000, 120000, None, None]

}

df = pd.DataFrame(data)
df

      Name   Age         City    Salary
0    Alice  25.0     New York   70000.0
1      Bob   NaN  Los Angeles   80000.0
2  Charlie  35.0      Chicago  120000.0
3    David  40.0      Houston       NaN
4      Eve   NaN      Phoenix       NaN

In [4]:
#  Check if any null value in 
df.isnull().sum() # Count of null values in each column

Name      0
Age       2
City      0
Salary    2
dtype: int64

In [5]:
df_drop = df.dropna() # Drop rows with any null values
df_drop

      Name   Age      City    Salary
0    Alice  25.0  New York   70000.0
2  Charlie  35.0   Chicago  120000.0

In [8]:
df_fill = df.fillna({'Age': df['Age'].mean(), 'Salary': df['Salary'].mean()}) # Fill null values with mean
df_fill

      Name        Age         City    Salary
0    Alice  25.000000     New York   70000.0
1      Bob  33.333333  Los Angeles   80000.0
2  Charlie  35.000000      Chicago  120000.0
3    David  40.000000      Houston   90000.0
4      Eve  33.333333      Phoenix   90000.0

In [9]:
df

      Name   Age         City    Salary
0    Alice  25.0     New York   70000.0
1      Bob   NaN  Los Angeles   80000.0
2  Charlie  35.0      Chicago  120000.0
3    David  40.0      Houston       NaN
4      Eve   NaN      Phoenix       NaN